SPPR_Test/src/Catalogs/Ошибки/Ошибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ошибки</name>
  <basedOn>Catalog.Ошибки</basedOn>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсправления</name>
    <type>
      <types>CatalogRef.ВерсииПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГдеИсправленаОшибка</name>
    <type>
      <types>CatalogRef.МестаИсправленияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияПубликации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтзыва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервойПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИзмененияПоСравнениюСРанееПринятымиПроектнымиРешениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособИсправления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособОбхода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыл</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированаИзАПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБазаДляВоспроизведения</name>
    <comment>Информационная база (описание, расположение), в которой воспроизводится ошибка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяИнформацияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>EnumRef.ВидыКлиентов1СПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОбращения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуНаправлена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоПривнес</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодВыявленияОшибки</name>
    <type>
      <types>EnumRef.МетодыВыявленияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПризнана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРасследуетсяПривнесение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРаздел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозвал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозвана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяемаяОшибка</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Ошибки</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВоспроизведения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Признана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНепризнания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПроекта</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаОбнаружения</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьПатч</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособИсправления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбхода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьИсправления</name>
    <type>
      <types>EnumRef.СрочностьИсправленияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.СтандартыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПубликации</name>
    <type>
      <types>EnumRef.СтатусыПубликацииОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СУБД</name>
    <type>
      <types>EnumRef.СУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПользователя</name>
    <type>
      <types>CatalogRef.СценарииРаботыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоследнегоПоручения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипПроблемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеИсходнойИнформацииОбОшибке</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПорядкаВоспроизведения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Обнаружена</name>
    <type>
      <types>EnumRef.МестаОбнаруженияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаОбнаружения</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправляется</name>
    <type>
      <types>EnumRef.ВариантыИсправленияОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаИсправления</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланируетсяИсправлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланируетИсправлять</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНеПланируетсяИсправлять</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаетИсправленияПовторяемой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановилОжидаетИсправленияПовторяемой</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОжидаетИсправленияПовторяемой</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентТипПлатформы</name>
    <type>
      <types>EnumRef.ТипПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверТипПлатформы</name>
    <type>
      <types>EnumRef.ТипПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательУказавшийПодразделение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Протокол</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыОшибок</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуНаправлена</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияИсправления</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>СрочностьИсправления</name>
      <type>
        <types>EnumRef.СрочностьИсправленияОшибок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыПроекта</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсправлениеВВетках</name>
    <attributes>
      <name>Ветка</name>
      <type>
        <types>CatalogRef.Ветки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВерсия</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеИсправления</name>
      <type>
        <types>EnumRef.СостоянияИсправленияОшибок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПривнесения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВеткаИсправления</name>
      <type>
        <types>CatalogRef.Ветки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработчикиОбновления</name>
    <attributes>
      <name>ОбработчикОбновления</name>
      <type>
        <types>CatalogRef.ОбработчикиОбновленияИнформационнойБазы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокОбъектов</name>
    <attributes>
      <name>ПроблемныйОбъект</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
        <types>CatalogRef.ОбработчикиОбновленияИнформационнойБазы</types>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодчиненныйОбъект</name>
      <type>
        <types>CatalogRef.РеквизитыОбъектовМетаданных</types>
        <types>CatalogRef.МакетыОбъектовМетаданных</types>
        <types>CatalogRef.ФормыОбъектовМетаданных</types>
        <types>EnumRef.ТипыМодулейОбъектовМетаданных</types>
        <types>CatalogRef.КомандыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешУточнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPPR_Test/src/Catalogs/Ошибки/Forms/ВыборЗначенийОтработал/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписок();
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Параметры.Свойство("СписокВыбора") Тогда
		СписокВыбора = Параметры.СписокВыбора;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из Список Цикл
		
		Если СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение)<>Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	
	ИсключеныЗначения = Ложь;
	
	Для Каждого ЭлементСписка из Список Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		Иначе
			ИсключеныЗначения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ИсключеныЗначения Тогда
		СписокВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	ОповеститьОВыборе(СписокВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписок()

	ДобавитьЗначениеСписка("Автор", НСтр("ru='Автор'"));
	ДобавитьЗначениеСписка("Зарегистрировал", НСтр("ru='Зарегистрировал'"));
	ДобавитьЗначениеСписка("Рассмотрел", НСтр("ru='Рассмотрел'"));
	ДобавитьЗначениеСписка("Исправил", НСтр("ru='Исправил'"));
	ДобавитьЗначениеСписка("Проверил", НСтр("ru='Проверил'"));
	ДобавитьЗначениеСписка("Отозвал", НСтр("ru='Отозвал'"));
	ДобавитьЗначениеСписка("Закрыл", НСтр("ru='Закрыл'"));
	ДобавитьЗначениеСписка("НеПланируетИсправлять", НСтр("ru='Установил <Не планируется исправлять>'"));
	ДобавитьЗначениеСписка("УстановилОжидаетИсправленияПовторяемой", НСтр("ru='Установил <Ожидает исправления повторяемой>'"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеСписка(Значение, Представление)

	Список.Добавить(Значение, Представление);
	
КонецПроцедуры
	
#КонецОбласти
